
#Область ПрограммныйИнтерфейс

//
//
Функция Создать(Цвет) Экспорт
	
	Ветвь = Новый Структура;
	Ветвь.Вставить("Цвет", Цвет);
	Ветвь.Вставить("Конец", 0);
	Ветвь.Вставить("Линии", Новый Массив);
	// TODO: Может быть перечисление а не строка?
	Ветвь.Вставить("ТочкаФиксации", "Точка2");
	
	Возврат Ветвь;
	
КонецФункции

//
//
Процедура ДобавитьЛинию(Ветвь, Точка1, Точка2, ТочкаФиксации) Экспорт
	
	Ветвь.Линии.Добавить(
		Новый Структура("Точка1, Точка2, ТочкаФиксации",
			Точка1, Точка2, "Точка2"));
	// TODO: isCommitted
	//Если  Тогда
	//Иначе
	//КонецЕсли;
		
КонецПроцедуры

//
//
Процедура УстановитьКонец(Ветвь, Конец) Экспорт
	
	Ветвь.Конец = Конец;
	
КонецПроцедуры

//
//
Функция Визуализировать(Ветвь, Настройки) Экспорт
	
	Цвет = Настройки.Цвета[Ветвь.Цвет % Настройки.Цвета.Количество()];
	
	КоэффициентИскривления = Настройки.Сетка.Y * 0.38; // 0.8
	Svg = "";
	Линии = Новый Массив;
	ТекущийПуть = "";
	
	Для каждого Линия Из Ветвь.Линии Цикл
		
		X1 = Линия.Точка1.X * Настройки.Сетка.X + Настройки.Сетка.ОтступX;
		Y1 = Линия.Точка1.Y * Настройки.Сетка.Y + Настройки.Сетка.ОтступY;
		X2 = Линия.Точка2.X * Настройки.Сетка.X + Настройки.Сетка.ОтступX;
		Y2 = Линия.Точка2.Y * Настройки.Сетка.Y + Настройки.Сетка.ОтступY;
		
		Линии.Добавить(
			ЛинияСРазмещением(X1, Y1, X2, Y2, Линия.ТочкаФиксации)); // TODO: isCommitted
		
	КонецЦикла;
	
	Сч = 0;
	Пока Сч < Линии.Количество() - 1 Цикл
		
		Линия = Линии[Сч];
		СледующаяЛиния = Линии[Сч + 1]; // Контроль превышения пределов массива
		
		Если Линия.Точка1.X = Линия.Точка2.X
			И Линия.Точка2.X = СледующаяЛиния.Точка1.X
			И СледующаяЛиния.Точка1.X = СледующаяЛиния.Точка2.X
			И Линия.Точка2.Y = СледующаяЛиния.Точка1.Y
		Тогда
			Линия.Точка2.Y = СледующаяЛиния.Точка2.Y;
			// TODO:
		Иначе
			Сч = Сч + 1;
		КонецЕсли;
		
	КонецЦикла;
	
	Для Сч = 0 По Линии.Количество() - 1 Цикл
		
		Линия = Линии[Сч];
		X1 = Линия.Точка1.X;
		Y1 = Линия.Точка1.Y;
		X2 = Линия.Точка2.X;
		Y2 = Линия.Точка2.Y;
		
		Если Не ПустаяСтрока(ТекущийПуть) И Сч > 0 Тогда
			ОтобразитьПуть(Svg, ТекущийПуть, Цвет);
			ТекущийПуть = "";
		КонецЕсли;
		
		ФорматнаяСтрокаX = "ЧДЦ=0; ЧРД=.; ЧГ=0";
		ФорматнаяСтрокаY = "ЧДЦ=1; ЧРД=.; ЧГ=0";
		
		Если ПустаяСтрока(ТекущийПуть)
			Или (Сч > 0 И (Не X1 = Линии[Сч - 1].Точка2.Z Или Не Y1 = Линии[Сч - 1].Точка2.Y))
		Тогда
			ТекущийПуть = ТекущийПуть + СтрШаблон("M%1,%2", Формат(X1, ФорматнаяСтрокаX), Формат(Y1, ФорматнаяСтрокаY));
		КонецЕсли;
		
		Если X1 = X2 Тогда
			ТекущийПуть = ТекущийПуть + СтрШаблон("L%1,%2", Формат(X2, ФорматнаяСтрокаX), Формат(Y2, ФорматнаяСтрокаY));
		Иначе
			ТекущийПуть = ТекущийПуть + СтрШаблон("L%1L%2,%3",
				?(Линия.ТочкаФиксации = "Точка1",
					СтрШаблон("%1,%2", Формат(X2, ФорматнаяСтрокаX), Формат(Y2 - КоэффициентИскривления, ФорматнаяСтрокаY)),
					СтрШаблон("%1,%2", Формат(X1, ФорматнаяСтрокаX), Формат(Y1 + КоэффициентИскривления, ФорматнаяСтрокаY))),
				Формат(X2, ФорматнаяСтрокаX),
				Формат(Y2, ФорматнаяСтрокаY));
		КонецЕсли;
		
	КонецЦикла;
	
	Если Не ПустаяСтрока(ТекущийПуть) Тогда
		ОтобразитьПуть(Svg, ТекущийПуть, Цвет);
	КонецЕсли;
	
	Возврат Svg;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЛинияСРазмещением(X1, Y1, X2, Y2, ТочкаФиксации)
	
	СтруктураТочки1 = Новый Структура("X, Y", X1, Y1);
	СтруктураТочки2 = Новый Структура("X, Y", X2, Y2);
	
	Возврат Новый Структура("Точка1, Точка2, ТочкаФиксации",
		СтруктураТочки1, СтруктураТочки2, ТочкаФиксации);
	
КонецФункции

Процедура ОтобразитьПуть(Svg, ТекущийПуть, Цвет)
	
	SvgЛинии = СтрШаблон("<path class=""line"" stroke=""%1"" d=""%2"" />",
		Цвет, ТекущийПуть); // TODO: isCommitted
	SvgТени = СтрШаблон("<path class=""shadow"" d=""%1"" />",
		ТекущийПуть);
	
	Svg = Svg + SvgЛинии + SvgТени;
	
КонецПроцедуры

#КонецОбласти
