
#Область ПрограммныйИнтерфейс

//
//
Функция Создать(Идентификатор) Экспорт
	
	Точка = Новый Структура;
	Точка.Вставить("Идентификатор", Идентификатор);
	Точка.Вставить("Родители", Новый Массив);
	Точка.Вставить("Потомки", Новый Массив);
	Точка.Вставить("НомерСледующегоРодителя", 0);
	Точка.Вставить("Ветвь", Неопределено);
	Точка.Вставить("X", 0);
	Точка.Вставить("СледующийX", 0);
	Точка.Вставить("Соединения", Новый Массив);
	
	Возврат Точка;
	
КонецФункции

//
//
Функция ДобавитьРодителя(Точка, Родитель) Экспорт
	
	Точка.Родители.Добавить(Родитель);
	
КонецФункции

//
//
Функция ДобавитьПотомка(Точка, Потомок) Экспорт
	
	Точка.Потомки.Добавить(Потомок);
	
КонецФункции

//
//
Функция СледующийРодитель(Точка) Экспорт
	
	Если Точка.НомерСледующегоРодителя < Точка.Родители.Количество() Тогда
		Возврат Точка.Родители[Точка.НомерСледующегоРодителя];
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

//
//
Процедура УстановитьРодительОбработан(Точка) Экспорт
	
	Точка.НомерСледующегоРодителя = Точка.НомерСледующегоРодителя + 1;
	
КонецПроцедуры

//
//
Функция НеПринадлежитВетви(Точка) Экспорт
	
	Возврат Точка.Ветвь = Неопределено;
	
КонецФункции

//
//
Процедура ДобавитьКВетви(Точка, Ветвь, X) Экспорт
	
	Если Точка.Ветвь = Неопределено Тогда
		
		Точка.Ветвь = Ветвь;
		Точка.X = X;
		
	КонецЕсли;
	
КонецПроцедуры

//
//
Функция ЭтоОбъединение(Точка) Экспорт
	
	Возврат Точка.Родители.Количество() > 1;
	
КонецФункции

//
//
Функция ТекущаяПозиция(Точка) Экспорт
	
	Возврат Новый Структура("X, Y", Точка.X, Точка.Идентификатор);
	
КонецФункции

//
//
Функция СледующаяПозиция(Точка) Экспорт
	
	Возврат Новый Структура("X, Y", Точка.СледующийX, Точка.Идентификатор);
	
КонецФункции

//
//
Функция ПрисоединеннаяПозиция(Точка, ТочкаПрисоединения, Ветвь) Экспорт
	
	Сч = 0;
	Для каждого Соединение Из Точка.Соединения Цикл
		// TODO: Вот тут я не особо уверен в условии. Ладно с идентификатором ещё может быть, но цвет сравнивать как-то совсем слабо
		Если Не Соединение = Неопределено
			И Соединение.Точка.Идентификатор = ТочкаПрисоединения.Идентификатор
			И Соединение.Ветвь.Цвет = Ветвь.Цвет
		Тогда
			Возврат Новый Структура("X, Y", Сч, Точка.Идентификатор);
		КонецЕсли;

		Сч = Сч + 1;
	КонецЦикла;
	
	Возврат Неопределено;
	
КонецФункции

//
//
Процедура ЗарегистрироватьНедоступнуюТочку(Точка, X, ТочкаПрисоединения, Ветвь) Экспорт
	
	Если X = Точка.СледующийX Тогда
		СтруктураСоединения = Новый Структура("Точка, Ветвь",
			ТочкаПрисоединения, Ветвь);
		
		Точка.СледующийX = X + 1;
		Если X < Точка.Соединения.Количество() Тогда
			Точка.Соединения[X] = СтруктураСоединения;
		Иначе
			// TODO: Тут вероятно надо добавлять пропущенные элементы соединения если есть пропуски
			Для Сч = 0 По X - Точка.Соединения.Количество() Цикл
				Точка.Соединения.Добавить();
			КонецЦикла;
			Точка.Соединения.Добавить(СтруктураСоединения);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

//
//
Функция Визуализировать(Точка, Настройки) Экспорт
	
	Если Точка.Ветвь = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Цвет = Настройки.Цвета[Точка.Ветвь.Цвет % Настройки.Цвета.Количество()]; // TODO: isCommitted
	КругX = Точка.X * Настройки.Сетка.X + Настройки.Сетка.ОтступX;
	КругY = Точка.Идентификатор * Настройки.Сетка.Y + Настройки.Сетка.ОтступY;
	
	СтрокаФорматирования = "ЧГ=0";
	
	//Если  Тогда // TODO:
	//Иначе
		Svg = СтрШаблон("<circle cx=""%1"" cy=""%2"" r=""4"" fill=""%3"" />",
			Формат(КругX, СтрокаФорматирования), Формат(КругY, СтрокаФорматирования), Цвет);
	//КонецЕсли;
	
	Возврат Svg;
	
КонецФункции

#КонецОбласти
