
#Область ПрограммныйИнтерфейс

// Создает новую вевь репозитория. Можно сразу переключиться на новую созданную ветвь для дальнейшей работы с ней
//
// Параметры:
//   Путь          - Строка - путь к каталогу с git репозиторием
//   Имя           - Строка - имя создаваемой ветви
//   Переключиться - Булево - признак того, что требуется переключиться на созданную ветвь
//
// Возвращаемое значение:
//   Булево - Истина, если опреация была выполнена успешно
//
Функция Создать(Путь, Имя, Переключиться = Ложь) Экспорт
	
	Аргументы = Новый Массив;
	Если Переключиться Тогда
		Аргументы.Добавить("checkout");
		Аргументы.Добавить("-q");
		Аргументы.Добавить("-b");
		Аргументы.Добавить(Имя);
		Аргументы.Добавить("--no-track");
	Иначе
		Аргументы.Добавить("branch");
		Аргументы.Добавить("-q");
		Аргументы.Добавить(Имя);
	КонецЕсли;

	Попытка
		Результат = Git_ВыполнениеКомандКлиент.ВыполнитьКоманду(Путь, Аргументы);
		
		Если Результат.Успешно И ПустаяСтрока(Результат.Сообщение) Тогда
			Возврат Истина;
		КонецЕсли;
		
		Сообщить(Результат.Сообщение);
		Возврат Ложь;
	Исключение
		Сообщить(ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

// Переименовывает текущую ветвь репозитория git
//
// Параметры:
//   Путь                      - Строка - путь к каталогу с git репозиторием
//   Имя                       - Строка - имя переименовываемой ветви
//   ЗамещатьСуществующуюВетку - Булево - при установке данного флага в Истина, при переименовании происходит замещение
//                                        существующей ветви с таким же именем в случае её наличии
//
// Возвращаемое значение:
//   Булево - Истина, если опреация была выполнена успешно
//
Функция Переименовать(Путь, Имя, ЗамещатьСуществующуюВетку = Истина) Экспорт
	
	Аргументы = Новый Массив;
	Аргументы.Добавить("branch");
	Если ЗамещатьСуществующуюВетку Тогда
		Аргументы.Добавить("-M");
	Иначе
		// TODO: провверить какой ответ будет если с таким ключом переименовывать ветку когда в рпозитории
		//       уже есть ветка с этим именем. Должна быть ошибка. Но какая?
		Аргументы.Добавить("-m");
	КонецЕсли;
	Аргументы.Добавить(Имя);

	Попытка
		Результат = Git_ВыполнениеКомандКлиент.ВыполнитьКоманду(Путь, Аргументы);
		
		Если Результат.Успешно И ПустаяСтрока(Результат.Сообщение) Тогда
			Возврат Истина;
		КонецЕсли;
		
		Сообщить(Результат.Сообщение);
		Возврат Ложь;
	Исключение
		Сообщить(ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

#КонецОбласти
