
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УдалятьКаталогСРепозиториемПослеТеста = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	УстановитьДоступность();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВариантЗаданияПутиПриИзменении(Элемент)

	УстановитьДоступность();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Тест(Команда)
	
	Если ЕстьОшибкиПриЗаполненииПолей() Тогда
		Возврат;
	КонецЕсли;
	
	Элементы.ФормаТест.Доступность = Ложь;
	
	Попытка
		// Создать локальный каталог для тестового репозитория
		ПутьКЛокальномуРепозиторию = СоздатьКаталогДляПути();
	Исключение
		Сообщить("Ошибка при создании локального каталога");
		Элементы.ФормаТест.Доступность = Истина;
		Возврат;
	КонецПопытки;
	
	// git init
	Успешно = Git_ИнициализацияКлиент.Инициализировать(ПутьКЛокальномуРепозиторию);
	Если Успешно Тогда
		Сообщить("Репозиторий инициализирован");
	Иначе
		Сообщить("Ошибка при инициализации репозитория");
		Элементы.ФормаТест.Доступность = Истина;
		Возврат;
	КонецЕсли;

	Попытка
		// Создать README.md
		СоздатьТестовыйФайл(ПутьКЛокальномуРепозиторию);
	Исключение
		Сообщить("Ошибка при создании файла README.md");
		Элементы.ФормаТест.Доступность = Истина;
		Возврат;
	КонецПопытки;
	
	// git add
	Успешно = Git_БазовыеОперацииКлиент.ДобавитьИзменения(ПутьКЛокальномуРепозиторию);
	Если Успешно Тогда
		Сообщить("Файл REAME.md добавлен к репозиторию");
	Иначе
		Сообщить("Ошибка при добавлении файлов к репозиторию");
		Элементы.ФормаТест.Доступность = Истина;
		Возврат;
	КонецЕсли;
	
	// git commit
	Успешно = Git_КоммитыКлиент.Создать(ПутьКЛокальномуРепозиторию, "Initial commit");
	Если Успешно Тогда
		Сообщить("Коммит создан");
	Иначе
		Сообщить("Ошибка при создании коммита");
		Элементы.ФормаТест.Доступность = Истина;
		Возврат;
	КонецЕсли;

	// git branch -M
	Успешно = Git_ВетвлениеКлиент.Переименовать(ПутьКЛокальномуРепозиторию, "main", Истина);
	Если Успешно Тогда
		Сообщить("Ветка переименована");
	Иначе
		Сообщить("Ошибка при переименовании ветки репозитория");
		Элементы.ФормаТест.Доступность = Истина;
		Возврат;
	КонецЕсли;
	
	// git remote add
	Успешно = Git_УдаленныйРепозиторийКлиент.Добавить(ПутьКЛокальномуРепозиторию, Репозиторий);
	Если Успешно Тогда
		Сообщить("Удаленный репозиторий добавлен");
	Иначе
		Сообщить("Ошибка при добавления удаленного репозитория");
		Элементы.ФормаТест.Доступность = Истина;
		Возврат;
	КонецЕсли;

	// git push
	Успешно = Git_УдаленныйРепозиторийКлиент.Отправить(ПутьКЛокальномуРепозиторию, "main");
	Если Успешно Тогда
		Сообщить("Отправка данных в удаленный репозиторий выполнена");
	Иначе
		Сообщить("Ошибка при отправке данных в удаленный репозиторий");
		Элементы.ФормаТест.Доступность = Истина;
		Возврат;
	КонецЕсли;
	
	// Удалить каталог локального репозитория при необходимости
	Если УдалятьКаталогСРепозиториемПослеТеста Тогда
		Попытка
			УдалитьФайлы(ПутьКЛокальномуРепозиторию);
		Исключение
			Сообщить("Ошибка при удалении файлов репоитория на локальном диске");
		КонецПопытки;
	КонецЕсли;

	Элементы.ФормаТест.Доступность = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Функция ЕстьОшибкиПриЗаполненииПолей()

	Ошибка = Ложь;
	Если ВариантЗаданияПутиКРепозиторию = 1 И ПустаяСтрока(Путь) Тогда
		Сообщить("Поле ""Путь"" должно быть заполнено!");
		Ошибка = Истина;
	КонецЕсли;
	Если ПустаяСтрока(Репозиторий) Тогда
		Сообщить("Поле ""Репозиторий"" должно быть заполнено!");
		Ошибка = Истина;
	КонецЕсли;
	
	Если ВариантЗаданияПутиКРепозиторию = 1 Тогда
		Файл = Новый Файл(Путь);
		Если Файл.Существует() Тогда
			Сообщить("Уже существует каталог по выбранному пути! Для теста необходимо задать не существующий в системе путь к каталогу.");
			Ошибка = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если Не СтрНачинаетсяС(Репозиторий, "https://") Или Не СтрЗаканчиваетсяНа(Репозиторий, ".git") Тогда
		Сообщить("В поле ""Репозиторий"" необходимо ввести корректный адрес репозитория Git");
		Ошибка = Истина;
	КонецЕсли;
	
	Возврат Ошибка;

КонецФункции

&НаКлиенте
Функция СоздатьКаталогДляПути()
	
	Если ВариантЗаданияПутиКРепозиторию = 0 Тогда
		ПутьКЛокальномуРепозиторию = ПолучитьИмяВременногоФайла();
	Иначе
		ПутьКЛокальномуРепозиторию = Путь;
	КонецЕсли;
		
	СоздатьКаталог(ПутьКЛокальномуРепозиторию);
	
	Возврат ПутьКЛокальномуРепозиторию;
	
КонецФункции

&НаКлиенте
Процедура СоздатьТестовыйФайл(ПутьКЛокальномуРепозиторию)
	
	Текст = Новый ТекстовыйДокумент;
	Текст.УстановитьТекст("тест");
	Текст.Записать(СтрШаблон("%1/README.md", ПутьКЛокальномуРепозиторию), КодировкаТекста.UTF8);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступность()
	
	Элементы.Путь.Доступность = ВариантЗаданияПутиКРепозиторию = 1;
	
КонецПроцедуры

#КонецОбласти
