
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОтобразтьДанныеТекущейВетки();
	УстановитьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ИнициализироватьРепозиторий(Команда)
	
	// TODO: Проверить текущий статус пути к репозиторию. Что каталог он существует или выше.
	//       Насколько я понимаю, повторно запускать команду инициализации никто не запрещает
	Успешно = Git_ИнициализацияКлиент.Инициализировать(Путь);
	ОтобразтьДанныеТекущейВетки(Путь);
	УстановитьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьДанные(Команда)
	
	// TODO: Проверить текущий статус пути к репозиторию. Что каталог он существует или выше.
	//       Изменять данные можно в и каталоге без инициализации Git
	СоздатьТестовыйФайлИДобавитьДанные();
	ОбновитьДанныеОбИзмененныхФайлах();
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьИзменениеТекстаРедактирования(Элемент, Текст, СтандартнаяОбработка)
	
	ОтобразтьДанныеТекущейВетки(Текст);
	УстановитьДоступность();
	ОбновитьДанныеОбИзмененныхФайлах();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтобразтьДанныеТекущейВетки(Текст = "")
	
	Если Пустаястрока(Текст) Тогда
		ТекущаяВетка = "<Путь к репозиторию не задан!>";
		Возврат;
	КонецЕсли;
	
	Файл = Новый Файл(Текст);
	Если Не Файл.Существует() Тогда
		ТекущаяВетка = "<Введенный путь отсутствует в системе!>";
		Возврат;
	КонецЕсли;
	Если Не Файл.ЭтоКаталог() Тогда
		ТекущаяВетка = "<Введенный путь не является каталогом!>";
		Возврат;
	КонецЕсли;

	Статус = Git_БазовыеОперацииКлиент.Статус(Текст);
	Если Статус = Неопределено Тогда
		ТекущаяВетка = "<Каталог не инициализирован как репозиторий git!>";
	ИначеЕсли ПустаяСтрока(Статус) Тогда
		ТекущаяВетка = "<Ошибка получения статуса репозитория git!>";
	Иначе
		ТекущаяВетка = Статус;
	КонецЕсли;
	
	Если Не Путь = Текст Тогда
		Путь = Текст;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьДанныеОбИзмененныхФайлах()
	
	Файлы = Git_БазовыеОперацииКлиент.СтатусФайлов(Путь);
	
	ДобавленныеФайлы.Очистить();
	ИзмененныеФайлы.Очистить();
	
	Для каждого Файл Из Файлы.Отслеживаемые Цикл
		ДобавленныеФайлы.Добавить(Файл.Путь);
	КонецЦикла;
	Для каждого Файл Из Файлы.ДляДобавления Цикл
		ИзмененныеФайлы.Добавить(Файл.Путь);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступность()
	
	
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьТестовыйФайлИДобавитьДанные()
	
	Если Не СтрЗаканчиваетсяНа(Путь, "\") Тогда
		Путь = Путь + "\";
	КонецЕсли;

	Текст = Новый ТекстовыйДокумент;
	
	ИмяФайла = СтрШаблон("%1README.md", Путь);
	Файл = Новый Файл(ИмяФайла);
	Если Файл.Существует() Тогда
		Текст.Прочитать(ИмяФайла, КодировкаТекста.UTF8);
	КонецЕсли;
	
	Текст.ДобавитьСтроку(СтрШаблон("Тест_%1", Текст.КоличествоСтрок()));
	Текст.Записать(ИмяФайла, КодировкаТекста.UTF8);
	
КонецПроцедуры
