#Область ПрограммныйИнтерфейс

Функция Pull(Путь, Имя = "origin", Ветвь = "master") Экспорт
    Аргументы = Новый Массив;
    Аргументы.Добавить("pull");
    Аргументы.Добавить("-q");
    Аргументы.Добавить(Имя);
    Аргументы.Добавить(Ветвь);

    Попытка
        Результат = Git_ВыполнениеКомандКлиент.ВыполнитьКоманду(Путь, Аргументы);
        Если Результат.Успешно Тогда
            Возврат Истина;
        КонецЕсли;
        Сообщить(Результат.Сообщение);
        Возврат Ложь;
    Исключение
        Сообщить(ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
        Возврат Ложь;
    КонецПопытки;
КонецФункции
#КонецОбласти