
#Область ПрограммныйИнтерфейс

// Выполняет команду git с переданными аргументами. Возвращает результат выполнения команды
//
// Параметры:
//   ИмяКаталога       - Строка           - путь к каталогу в котором будет выполнена команда
//   Аргументы         - Массив из Строка - аргумены передаваемые команде
//   ЗакрыватьОкно     - Булево           - 
//   ПоказыватьОкно    - Булево           - 
//   ОжидатьЗавершения - Булево           - 
//
// Возвращаемое значение:
//   Структура:
//     * Успешно   - Булево - признак успешности выполнения команды
//     * Сообщение - Строка - текст результата выполнения команды или текст ошибки
//
Функция ВыполнитьКоманду(ИмяКаталога, Аргументы, ЗакрыватьОкно = Истина, ПоказыватьОкно = Ложь, ОжидатьЗавершения = Истина) Экспорт
	
	WshShell = Новый COMОбъект("WScript.Shell");

	СтрокаКоманды = "git " + СтрСоединить(Аргументы, " ");
	
	ИмяФайлаПотокаВывода = ПолучитьИмяВременногоФайла("stdout.tmp");
	СтрокаКоманды = СтрокаКоманды + " > """ + ИмяФайлаПотокаВывода + """";
	
	ИмяФайлаПотокаОшибок = ПолучитьИмяВременногоФайла("stderr.tmp");
	СтрокаКоманды = СтрокаКоманды + " 2>""" + ИмяФайлаПотокаОшибок + """";
	
	Если ЗначениеЗаполнено(ИмяКаталога) Тогда
		МассивПодстрок = СтрРазделить(ИмяКаталога, ":\",Ложь);
		Если МассивПодстрок.Количество() > 0 Тогда
			ИмяДиска = МассивПодстрок.Получить(0)+":";
			КомандаСменитьКаталог = " "+ИмяДиска + " && " + " cd " + ИмяКаталога;
			
			СтрокаКоманды = КомандаСменитьКаталог + " && " + СтрокаКоманды;
		КонецЕСли;
	КонецЕсли;
	
	Если ЗакрыватьОкно = Истина Тогда
		СтрокаКоманды = "cmd /c "+СтрокаКоманды;
	Иначе
		СтрокаКоманды = "cmd /k "+СтрокаКоманды;
	КонецЕСли;
	
	Если ПоказыватьОкно = Истина Тогда
		WshShell.Run(СтрокаКоманды, 1,ОжидатьЗавершения);
	Иначе
		WshShell.Run(СтрокаКоманды, 0,ОжидатьЗавершения);
	КонецЕСли;

	ПотокВывода = "";
	ПотокОшибок = "";
	КодировкаПотоков = "UTF-8";

	ПотокВывода = ПрочитатьФайлЕслиСуществует(ИмяФайлаПотокаВывода, КодировкаПотоков);
	УдалитьВременныйФайл(ИмяФайлаПотокаВывода);

	ПотокОшибок = ПрочитатьФайлЕслиСуществует(ИмяФайлаПотокаОшибок, КодировкаПотоков);
	УдалитьВременныйФайл(ИмяФайлаПотокаОшибок);
	
	Если Не ПустаяСтрока(ПотокОшибок) Тогда
		Возврат Новый Структура("Успешно, Сообщение", Ложь, ПотокОшибок);
	КонецЕсли;
	
	Возврат Новый Структура("Успешно, Сообщение", Истина, ПотокВывода);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПрочитатьФайлЕслиСуществует(Путь, Кодировка)
	
	Результат = Неопределено;
	ФайлИнфо = Новый Файл(Путь);
	
	Если ФайлИнфо.Существует() Тогда 
		
		ЧтениеПотокаОшибок = Новый ЧтениеТекста(Путь, Кодировка);
		Результат = ЧтениеПотокаОшибок.Прочитать();
		ЧтениеПотокаОшибок.Закрыть();
		
	КонецЕсли;
	
	Если Результат = Неопределено Тогда 
		Результат = "";
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция УдалитьВременныйФайл(Знач Путь)
	
	Если НЕ ЭтоИмяВременногоФайла(Путь) Тогда
		ВызватьИсключение СтрШаблон(
			НСтр("ru = 'Неверное значение параметра %1 в %2:
				|Файл не является временным ""%3"".'"), 
			"Путь", "ФайловаяСистема.УдалитьВременныйФайл", Путь);
	КонецЕсли;
	
	УдалитьВременныеФайлы(Путь);
	
КонецФункции

Функция УдалитьВременныеФайлы(Знач Путь)
	
	Попытка
		УдалитьФайлы(Путь);
	Исключение
		Сообщить(СтрШаблон(НСтр("ru = 'Не удалось удалить временный файл ""%1"" по причине:
				|%2'"),
			Путь,
			ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке())));
			
		Возврат Ложь;
	КонецПопытки;

	Возврат Истина;
	
КонецФункции

Функция ЭтоИмяВременногоФайла(Путь)
	
	// Ожидается, что Путь получен методом ПолучитьИмяВременногоФайла().
	// Перед проверкой разворачиваем слэши в одну сторону.
	Возврат СтрНачинаетсяС(СтрЗаменить(Путь, "/", "\"),
		СтрЗаменить(КаталогВременныхФайлов(), "/", "\"));
	
КонецФункции

#КонецОбласти
