
#Область ПрограммныйИнтерфейс

//
//
// Параметры:
//    Путь                     - Строка - 
//    Ветка                    - Строка - 
//    ПоказыватьУдалённыеВетки - Булево - 
//
// Возвращаемое значение:
//    Массив Из Структура
//
Функция Логи(Путь, Ветка = "", ПоказыватьУдалённыеВетки = Истина) Экспорт
	
	Разделитель = "XX7Nal-YARtTpjCikii9nJxER19D6diSyk-AWkPb";
	
	// TODO:
	//ПолеДаты = ?(ТипДаты = "Author Date", "%at", "%ct");
	ПолеДаты = "%at";
	
	МассивЭлементовФормата = Новый Массив;
	МассивЭлементовФормата.Добавить("%H");
	МассивЭлементовФормата.Добавить("%h");
	МассивЭлементовФормата.Добавить("%P");
	МассивЭлементовФормата.Добавить("%p");
	МассивЭлементовФормата.Добавить("%an");
	МассивЭлементовФормата.Добавить("%ae");
	МассивЭлементовФормата.Добавить(ПолеДаты);
	МассивЭлементовФормата.Добавить("%s");
	МассивЭлементовФормата.Добавить("%T");
	МассивЭлементовФормата.Добавить("%t");
	МассивЭлементовФормата.Добавить("%d");
	ФорматЛога = СтрСоединить(МассивЭлементовФормата, Разделитель);
	
	Аргументы = Новый Массив;
	Аргументы.Добавить("log");
	// TODO:
	//Аргументы.Добавить("--max-count=" + МаксимальноеКоличествоЗаписей);
	Аргументы.Добавить("--format=" + ФорматЛога);
	Аргументы.Добавить("--author-date-order");
	//Аргументы.Добавить("--reverse");
	
	Если Не ПустаяСтрока(Ветка) Тогда
		Аргументы.Добавить(Ветка);
	Иначе
		Аргументы.Добавить("--branches");
		Аргументы.Добавить("--tags");
		Если ПоказыватьУдалённыеВетки Тогда
			Аргументы.Добавить("--remotes");
		КонецЕсли;
	КонецЕсли;
	
	Попытка
		Результат = Git_ВыполнениеКомандКлиент.ВыполнитьКоманду(Путь, Аргументы);
		
		Логи = РазобратьЛоги(Результат, Разделитель);
		Возврат Логи;
	Исключение
		Сообщить(ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		Возврат Новый Массив;
	КонецПопытки;
	
КонецФункции

//
//
Функция Ссылки(Путь, ПоказыватьУдалённыеВетки = Истина) Экспорт
	
	Аргументы = Новый Массив;
	Аргументы.Добавить("show-ref");
	Если ПоказыватьУдалённыеВетки Тогда
		Аргументы.Добавить("--heads");
		Аргументы.Добавить("--tags");
	КонецЕсли;
    Аргументы.Добавить("-d");
	Аргументы.Добавить("--head");

	Попытка
		Результат = Git_ВыполнениеКомандКлиент.ВыполнитьКоманду(Путь, Аргументы);

		Ссылки = РазобратьСсылки(Результат);
		Возврат Ссылки;
	Исключение
		Сообщить(ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		Возврат Новый Структура("ТекущийКоммит, Ссылки", Неопределено, Новый Массив);
	КонецПопытки;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РазобратьЛоги(Логи, Разделитель)
	
	Коммиты = Новый Массив;
	
	Для Сч = 1 По СтрЧислоСтрок(Логи) Цикл
		
		ОчереднаяСтрока = СтрПолучитьСтроку(Логи, Сч);
		МассивПараметров = РазложитьСтрокуВМассивПодстрок(ОчереднаяСтрока, Разделитель);
		Если Не МассивПараметров.Количество() = 11 Тогда
			Прервать;
		КонецЕсли;
		
		СтруктураКоммита = Новый Структура;
		СтруктураКоммита.Вставить("hash",          МассивПараметров[0]);
		СтруктураКоммита.Вставить("hashAbbrev",    МассивПараметров[1]);
		СтруктураКоммита.Вставить("parents",       ?(ПустаяСтрока(МассивПараметров[2]), Новый Массив, СтрРазделить(МассивПараметров[2], " ")));
		СтруктураКоммита.Вставить("parentsAbbrev", ?(ПустаяСтрока(МассивПараметров[3]), Новый Массив, СтрРазделить(МассивПараметров[3], " ")));
		СтруктураКоммита.Вставить("author",        Новый Структура("name, email, timestamp",
			МассивПараметров[4], МассивПараметров[5], Число(МассивПараметров[6]) * 1000));
		СтруктураКоммита.Вставить("subject",       МассивПараметров[7]);
	    СтруктураКоммита.Вставить("tree",          МассивПараметров[8]);
	    СтруктураКоммита.Вставить("treeAbbrev",    МассивПараметров[9]);
	    СтруктураКоммита.Вставить("refs",          ПреобразоватьСсылкиВМассив(МассивПараметров[10]));
		
		Коммиты.Добавить(СтруктураКоммита);
		
	КонецЦикла;
	
	Возврат Коммиты;
	
КонецФункции

Функция РазобратьСсылки(Ссылки)
	
	ТекущийКоммит = Неопределено;
	МассивСсылок = Новый Массив;
	
	Для Сч = 1 По СтрЧислоСтрок(Ссылки) Цикл
		
		ОчереднаяСтрока = СтрПолучитьСтроку(Ссылки, Сч);
		МассивЧастей = СтрРазделить(ОчереднаяСтрока, " ");
		Если МассивЧастей.Количество() < 2 Тогда
			Продолжить;
		КонецЕсли;
		
		Хэш = МассивЧастей[0];
		МассивЧастей.Удалить(0);
		Ссылка = СтрСоединить(МассивЧастей, " ");
		
		МассивСсылок.Добавить(Новый Структура("hash, ref",
			Хэш, Ссылка));
		
	КонецЦикла;
	
	Возврат МассивСсылок;
	
КонецФункции

// Разбивает строку на несколько строк по указанному разделителю. Разделитель может иметь любую длину.
// В случаях, когда разделителем является строка из одного символа, и не используется параметр СокращатьНепечатаемыеСимволы,
// рекомендуется использовать функцию платформы СтрРазделить.
//
// Параметры:
//  Значение               - Строка - текст с разделителями.
//  Разделитель            - Строка - разделитель строк текста, минимум 1 символ.
//  ПропускатьПустыеСтроки - Булево - признак необходимости включения в результат пустых строк.
//    Если параметр не задан, то функция работает в режиме совместимости со своей предыдущей версией:
//     > для разделителя-пробела пустые строки не включаются в результат, для остальных разделителей пустые строки
//       включаются в результат;
//     > если параметр Строка не содержит значащих символов или не содержит ни одного символа (пустая строка), то в
//       случае разделителя-пробела результатом функции будет массив, содержащий одно значение "" (пустая строка), а
//       при других разделителях результатом функции будет пустой массив.
//  СокращатьНепечатаемыеСимволы - Булево - сокращать непечатаемые символы по краям каждой из найденных подстрок.
//
// Возвращаемое значение:
//  Массив из Строка
//
// Пример:
//  СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(",один,,два,", ",")
//  - возвратит массив из 5 элементов, три из которых  - пустые: "", "один", "", "два", "";
//  СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(",один,,два,", ",", Истина)
//  - возвратит массив из двух элементов: "один", "два";
//  СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(" один   два  ", " ")
//  - возвратит массив из двух элементов: "один", "два";
//  СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок("")
//  - возвратит пустой массив;
//  СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок("",,Ложь)
//  - возвратит массив с одним элементом: ""(пустая строка);
//  СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок("", " ")
//  - возвратит массив с одним элементом: "" (пустая строка).
//
Функция РазложитьСтрокуВМассивПодстрок(Знач Значение, Знач Разделитель = ",", Знач ПропускатьПустыеСтроки = Неопределено, 
	СокращатьНепечатаемыеСимволы = Ложь)
	
	Если СтрДлина(Разделитель) = 1 
		И ПропускатьПустыеСтроки = Неопределено 
		И СокращатьНепечатаемыеСимволы Тогда 
		
		Результат = СтрРазделить(Значение, Разделитель, Ложь);
		Для Индекс = 0 По Результат.ВГраница() Цикл
			Результат[Индекс] = СокрЛП(Результат[Индекс])
		КонецЦикла;
		Возврат Результат;
		
	КонецЕсли;
	
	Результат = Новый Массив;
	
	// Для обеспечения обратной совместимости.
	Если ПропускатьПустыеСтроки = Неопределено Тогда
		ПропускатьПустыеСтроки = ?(Разделитель = " ", Истина, Ложь);
		Если ПустаяСтрока(Значение) Тогда 
			Если Разделитель = " " Тогда
				Результат.Добавить("");
			КонецЕсли;
			Возврат Результат;
		КонецЕсли;
	КонецЕсли;
	//
	
	Позиция = СтрНайти(Значение, Разделитель);
	Пока Позиция > 0 Цикл
		Подстрока = Лев(Значение, Позиция - 1);
		Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Подстрока) Тогда
			Если СокращатьНепечатаемыеСимволы Тогда
				Результат.Добавить(СокрЛП(Подстрока));
			Иначе
				Результат.Добавить(Подстрока);
			КонецЕсли;
		КонецЕсли;
		Значение = Сред(Значение, Позиция + СтрДлина(Разделитель));
		Позиция = СтрНайти(Значение, Разделитель);
	КонецЦикла;
	
	Если Не ПропускатьПустыеСтроки Или Не ПустаяСтрока(Значение) Тогда
		Если СокращатьНепечатаемыеСимволы Тогда
			Результат.Добавить(СокрЛП(Значение));
		Иначе
			Результат.Добавить(Значение);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции 

Функция ПреобразоватьСсылкиВМассив(Знач СтрокаСсылок)
	
	Результат = Новый Массив;
	
	СтрокаСсылок = СтрЗаменить(СтрокаСсылок, "(", "");
	СтрокаСсылок = СтрЗаменить(СтрокаСсылок, ")", "");
	СтрокаСсылок = СтрЗаменить(СтрокаСсылок, "->", ",");
	
	МассивСсылок = РазложитьСтрокуВМассивПодстрок(СтрокаСсылок, ", ");
	Для Сч = 0 По МассивСсылок.Количество() - 1 Цикл
		Если Не ПустаяСтрока(СокрЛП(МассивСсылок[Сч])) Тогда
			Результат.Добавить(СокрЛП(МассивСсылок[Сч]));
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти