
#Область ПрограммныйИнтерфейс

// Добавляет содержимое новых или измененных файлов в индекс (git add ...)
//
// Параметры:
//   Путь  - Строка           - путь к каталогу с git репозиторием
//   Файлы - Массив Из Строка - 
//
// Возвращаемое значение:
//   Булево - Истина, если опреация была выполнена успешно
//
Функция ДобавитьИзменения(Путь, Файлы = Неопределено) Экспорт
	
	Аргументы = Новый Массив;
	Аргументы.Добавить("add");
	Аргументы.Добавить("-A"); // TODO: "-u"
	Если ТипЗнч(Файлы) = Тип("Массив") Тогда
		// TODO:
	Иначе
		Аргументы.Добавить("--");
		Аргументы.Добавить(".");
	КонецЕсли;

	Попытка
		Результат = Git_ВыполнениеКомандКлиент.ВыполнитьКоманду(Путь, Аргументы);
		
		Если Результат.Успешно И ПустаяСтрока(Результат.Сообщение) Тогда
			Возврат Истина;
		КонецЕсли;
		
		Сообщить(Результат.Сообщение);
		Возврат Ложь;
	Исключение
		Сообщить(ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

// Возвращает наименование текущей ветви репозитория git
//
// Параметры:
//   Путь  - Строка           - путь к каталогу с git репозиторием
//
// Возвращаемое значение:
//   Строка, Неопределено - наименование ветви. Если путь не ведёт к репозиторию git, то Неопределено
//
Функция Статус(Путь) Экспорт
	
	Аргументы = Новый Массив;
	Аргументы.Добавить("status");

	Попытка
		Результат = Git_ВыполнениеКомандКлиент.ВыполнитьКоманду(Путь, Аргументы);
		
		СтрокаОтветаGit = "fatal: not a git repository (or any of the parent directories): .git" + Символы.ПС;
		Если Не Результат.Успешно И Результат.Сообщение = СтрокаОтветаGit Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		ПерваяСтрока = СтрПолучитьСтроку(Результат, 1);
		
		Возврат СтрЗаменить(ПерваяСтрока, "On branch ", "");
	Исключение
		Сообщить(ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		Возврат "";
	КонецПопытки;
	
КонецФункции

// Возвращет массивы измененных файлов. Отдельно те которые уже были ранее добавлены в индекс - Отслеживаемые
// и отдельно те, которые ещё не были добавлены - ДляДобавления
//
// Параметры:
//   Путь  - Строка           - путь к каталогу с git репозиторием
//
// Возвращаемое значение:
//   Структура:
//    * Отслеживаемые - Массив - файлы, которые уже были ранее добавлены в индекс, но были
//                               изменены (удалены, перемещены и т.д.)
//    * ДляДобавления - Массив - файлы, которые ранее ещё не были добавлены к индексу
//
Функция СтатусФайлов(Путь) Экспорт

	Аргументы = Новый Массив;
	Аргументы.Добавить("status");
	Аргументы.Добавить("-s");
	Аргументы.Добавить("-uall");

	Попытка
		Результат = Git_ВыполнениеКомандКлиент.ВыполнитьКоманду(Путь, Аргументы);
		
		Возврат СтатусыФайлов(Результат.Сообщение);
	Исключение
		Сообщить(ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		Возврат Новый Структура("Отслеживаемые, ДляДобавления",
			Новый Массив, Новый Массив);
	КонецПопытки;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СтатусыФайлов(Знач Данные)
	
	ФайлыОтслеживаемые = Новый Массив;
	ФайлыДляДобавления = Новый Массив;
	
	Для Сч = 1 По СтрЧислоСтрок(Данные) Цикл
		
		СтрокаСведенийОФайле = СтрПолучитьСтроку(Данные, Сч);
		МассивСеденийОФайле = СтрРазделить(СтрокаСведенийОФайле, " ");
		Если Не МассивСеденийОФайле.Количество() = 2 Тогда
			Продолжить;
		КонецЕсли;
		
		Статусы = МассивСеденийОФайле[0];
		СостояниеВИндексе    = Лев(Статусы, 1);
		СостояниеВДиректории = Прав(Статусы, 1);
		
		ОписаниеФайла = ОписаниеФайла(СостояниеВИндексе, СостояниеВДиректории, МассивСеденийОФайле[1]);
		
		//' ' (пробел) — нет изменений
		//M — modified
		//A — added
		//D — deleted
		//R — renamed
		//C — copied
		//? — untracked
		//! — ignored
		Если Не СостояниеВИндексе = " " И Не СостояниеВИндексе = "!" И Не СостояниеВДиректории = "?" Тогда
			ФайлыОтслеживаемые.Добавить(ОписаниеФайла);
		КонецЕсли;
		Если Не СостояниеВДиректории = " " И Не СостояниеВДиректории = "!" Тогда
			ФайлыДляДобавления.Добавить(ОписаниеФайла);
		КонецЕсли;
		
	КонецЦикла;
		
	Возврат Новый Структура("Отслеживаемые, ДляДобавления",
		ФайлыОтслеживаемые, ФайлыДляДобавления);
	
КонецФункции

Функция ОписаниеФайла(СостояниеВИндексе, СостояниеВДиректории, Путь)
	
	Возврат Новый Структура("СостояниеВИндексе, СостояниеВДиректории, Путь",
		СостояниеВИндексе, СостояниеВДиректории, Путь);
	
КонецФункции

#КонецОбласти
