
#Область ПрограммныйИнтерфейс

// Осуществляет инициализацию каталога на диске в качестве репозитория (git init)
//
// Параметры:
//   Путь             - Строка - путь к каталогу с git репозиторием
//   ВетвьПоУмолчанию - Строка - имя ветки по-умолчанию. Если не задано, то будет "master"
//                               или "main" в зависимости от версии git
//
// Возвращаемое значение:
//   Булево - Истина, если опреация была выполнена успешно
//
Функция Инициализировать(Путь, ВетвьПоУмолчанию = "") Экспорт
	
	Аргументы = Новый Массив;
	Аргументы.Добавить("init");
	Если Не ПустаяСтрока(ВетвьПоУмолчанию) Тогда
		Аргументы.Добавить("-b");
		Аргументы.Добавить(ВетвьПоУмолчанию);
	КонецЕсли;

	Попытка
		Результат = Git_ВыполнениеКомандКлиент.ВыполнитьКоманду(Путь, Аргументы);
		
		СкорректированныйПуть = СтрЗаменить(Путь, "\", "/");
		// TODO: Разобраться с оконечным слэшем
		СтрокаОтветаGit = СтрШаблон("Initialized empty Git repository in %1/.git/" + Символы.ПС, СкорректированныйПуть);
		// TODO: Для существующего репозитория ответ: Reinitialized existing Git repository in %1/.git/
		Если Результат.Успешно И НРег(Результат.Сообщение) = НРег(СтрокаОтветаGit) Тогда
			Возврат Истина;
		КонецЕсли;
		
		Сообщить(Результат.Сообщение);
		Возврат Ложь;
	Исключение
		Сообщить(ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции

#КонецОбласти
