
#Область ПрограммныйИнтерфейс

// Связывет локальный репозиторий с удаленным (git remote add...)
//
// Параметры:
//   Путь           - Строка - путь к каталогу с git репозиторием
//   UrlРепозитория - Строка - URL удаленного репозитория
//   Имя            - Строка - название удаленного репозитория. Может быть произвольным, т.к. используется только
//                             на локальной машине. Однако, чаще всего это просто "origin".
//
// Возвращаемое значение:
//   Булево - Истина, если опреация была выполнена успешно
//
Функция Добавить(Путь, UrlРепозитория, Имя = "origin") Экспорт
	
	Аргументы = Новый Массив;
	Аргументы.Добавить("remote");
	Аргументы.Добавить("add");
	Аргументы.Добавить(Имя);
	Аргументы.Добавить(UrlРепозитория);
	
	Попытка
		Результат = Git_ВыполнениеКомандКлиент.ВыполнитьКоманду(Путь, Аргументы);
		
		Если Результат.Успешно И ПустаяСтрока(Результат.Сообщение) Тогда
			Возврат Истина;
		КонецЕсли;
		
		Сообщить(Результат.Сообщение);
		Возврат Ложь;
	Исключение
		Сообщить(ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		Возврат Ложь;
	КонецПопытки;

КонецФункции

// Отправляет изменения из локального репозитория в удаленный (git push -u origin...)
//
// Параметры:
//   Путь           - Строка - путь к каталогу с git репозиторием
//   Ветвь          - Строка - 
//   Имя            - Строка - название удаленного репозитория. Может быть произвольным, т.к. используется только
//                             на локальной машине. Однако, чаще всего это просто "origin".
//
// Возвращаемое значение:
//   Булево - Истина, если опреация была выполнена успешно
//
Функция Отправить(Путь, Ветвь, Имя = "origin") Экспорт
	
	Аргументы = Новый Массив;
	Аргументы.Добавить("push");
	Аргументы.Добавить("-q");
	Аргументы.Добавить("-u");
	Аргументы.Добавить(Имя);
	Аргументы.Добавить(Ветвь);
	
	Попытка
		Результат = Git_ВыполнениеКомандКлиент.ВыполнитьКоманду(Путь, Аргументы);
		
		Если Результат.Успешно Тогда
			Возврат Истина;
		КонецЕсли;
		
		Сообщить(Результат.Сообщение);
		Возврат Ложь;
	Исключение
		Сообщить(ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		
		Возврат Ложь;
	КонецПопытки;

КонецФункции

#КонецОбласти
